
using System.Xml.Linq;

Практичне заняття № 1. Створення класів в C#
16
1. Розробити консольний застосунок для роботи з класом  Student  з полями: name, age, course, rating.
Всі поля класу зробити закритими, а доступ до них реалізувати через властивості  get i set. Реалізувати конструктор з параметрами. 
Створити методи:
EditStudent для редагування даних студента і запису інформації  у текстовий файл.  Метод має 3 параметри для зміни значень полів name, age, rating.
StudentRating(double rating), який виводить рейтинг студента.
GetRole(int course) – повертає рядок: бакалавр чи магістр залежно від курсу.

2. Розробити клас Друкарське Видання з 4  полями: назва, тип (газета чи журнал), ціна, кількість сторінок.
Доступ  до полів реалізувати через get i set. Реалізувати конструктор без параметрів, а ініціалізацію полів виконати через властивості.
Створити 2 методи:
Перший метод виводить на консоль назву і тип видання.
Другий метод аналізує ціну і тип:
Якщо ціна > 10 грн. і тип=газета, виводить на консоль “Це занадто дорога газета” +<ціна>
Якщо ціна <10 грн. і тип = журнал, виводить на консоль “Це дешевий журнал” +<ціна>
Інакше виводить: “Це видання:” + < тип > “Його ціна:”+< ціна >

